class DateReference {
    // 时段
    timeInterval: ["凌晨", "早上", "上午", "中午", "下午", "傍晚", "晚上", "深夜"];
    // 时段对照表，左闭右开，并且（最后一个为或）
    timeIntervalCrt: [[1, 5], [5, 8], [8, 11], [11, 13], [13, 17], [17, 19], [19, 23], [32, 1]];
    // 星期
    week: ["星期日", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六"];
    // 星期英文
    weekEn: ["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"];
    // 星期英文缩写
    weekEnAbbr: ["SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"];
    // 地支纪时对照表，左闭右开，并且（第一个为或）
    zhiTimeCrt: [[23, 1], [1, 3], [3, 5], [5, 7], [7, 9], [9, 11], [11, 13], [13, 15], [15, 17], [17, 19], [19, 21], [21, 23]];
    // 中文数字
    numCn = ['零', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十']
    // 天干
    gan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
    // 地支
    zhi = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]
    // 生肖
    zodiacCn = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]
    // 节气
    solarTerms = ['冬至', '小寒', '大寒', '立春', '雨水', '惊蛰', '春分', '清明', '谷雨', '立夏', '小满', '芒种', '夏至', '小暑', '大暑', '立秋', '处暑', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪']
    // 月名
    monthNameCn = ['十一', '十二', '正', '二', '三', '四', '五', '六', '七', '八', '九', '十']
    // 日名
    dayNameCn = ['初一', '初二', '初三', '初四', '初五', '初六', '初七', '初八', '初九', '初十', '十一', '十二', '十三', '十四', '十五', '十六', '十七', '十八', '十九', '二十', '廿一', '廿二', '廿三', '廿四', '廿五', '廿六', '廿七', '廿八', '廿九', '三十', '卅一']
    // 月相名
    lunarPhase = ["朔", "上弦", "望", "下弦"]
}
